<template>
  <AppPage title="הצהרת נגישות">
    <AppCard :header="`הצהרת הנגישות של אתר ${title}`">
      <p class="lead">
        הצהרת הנגישות עודכנה בתאריך 27/07/2023.
      </p>
      <p>
        אנו פועלים רבות על מנת להנגיש את הארגון ואת אתר האינטרנט שלנו לאנשים עם מוגבלות על מנת לקדם שוויון זכויות ושקיפות כלפי אנשים עם מוגבלות.
      </p>
      <h2>
        מהות אתר אינטרנט נגיש
      </h2>
      <p>
        אתר אינטרנט נגיש, הינו אתר המאפשר לאדם עם מוגבלות, לגלוש באותה רמת יעילות והנאה כגולשים אחרים, תוך שימוש ביכולות המערכת עליה הוא פועל ובאמצעות טכנולוגיות מסייעות לנגישות.
      </p>
      <h2>
        ביצוע התאמות הנגישות באתר האינטרנט
      </h2>
      <p>
        התאמות הנגישות באתר בוצעו בהתאם לסימן ג': שירותי האינטרנט בתקנות שוויון זכויות לאנשים עם מוגבלות (התאמות נגישות לשירות) התשע"ג 2013, לתקן הישראלי ת"י 5568 המבוסס על הנחיותWCAG 2.0 , האתר הונגש לרמה A ובכפוף לשינויים והתאמות שבוצעו במסמך התקן הישראלי.
      </p>
      <p>
        האתר תומך בשימוש בטכנולוגיות מסייעות כגון תוכנות הקראת מסך, בגלישה בעזרת מקלדת על ידי שימוש במקשי ה-Tab וה-Shift+Tab למעבר בין קישורים, מקשי החיצים, מקש ה-Enter לבחירה, מקש ה-Esc ליציאה מתפריטים וחלונות, לחיצה על H או על מספר למעבר בין כותרות.
      </p>
      <p>
        האתר נבדק באופן קבוע כדי להבטיח את תחזוקת נגישות האתר.
      </p>
      <h2>
        הצהרה על עמידה חלקית בתקן במקרה של תכני צד ג'
      </h2>
      <p>
        בדפים מסוימים באתר נגישות הדף תלויה בתכנים שאינם של הארגון (תכני צד ג') ולכן אנחנו מצהירים על עמידה חלקית בתקן עבור דפים אילו.
      </p>
      <h2>
        ישימות מיטבית לנגישות באתר האינטרנט
      </h2>
      <p>
        באתר אינטרנט זה, ניתן לגלוש בצורה מיטבית ונגישה באמצעות הדפדפנים הנפוצים ומומלץ להשתמש בדפדפנים הבאים:  Firefox / Opera / Safari / Lynx]/ [Edge / Chrome ובתוכנות קוראות מסך.
      </p>
      <h2>
        הסדרי נגישות במועצה
      </h2>
      <p v-html="location.accessibilityStatement" />
      <h2>
        דרכי פניה לבקשות, תקלות נגישות והצעות לשיפור
      </h2>
      <p>
        במידה ומצאתם באתר האינטרנט בעיה בנושא הנגישות או שהנכם זקוקים עזרה, אתם מוזמנים לפנות אלינו דרך רכז הנגישות של הארגון:
      </p>
      <p>
        <strong>שם רכז: </strong>
        אילן מימון
        <br>
        <strong>טלפון: </strong>
        <a href="tel:0549789354">054-978-9354</a>
        <br>
        <strong>כתובת מייל: </strong>
        <a :href="`mailto:${communication.email}`">{{ communication.email }}</a>
      </p>
    </AppCard>
  </AppPage>
</template>

<script setup lang="ts">
import { siteConfigInjectionKey } from '../assets/injection-keys';

const { title, location, communication } = inject(siteConfigInjectionKey)!;
</script>